# IsInside Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Curve..::..IsInside Method
Curve Class See Also
---
Indicates whether the specified parameter value is within this curve's bounds.
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsInside(Double) | Indicates whether the specified parameter value is within this curve's bounds. |
| IsInside(Double, Int32%) | Indicates whether the specified parameter value is within this curve's bounds and outputs the end index. |

# See Also
Curve Class
Curve Members
Autodesk.Revit.DB Namespace